JavaWebClient/xml-resources/web-service-references/NpChunkerRoWS/wsdl/nlptools.infoiasi.ro/WebNpChunkerRo/NpChunkerRoWS.wsdl

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. --><!-- Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is JAX-WS RI 2.2-hudson-752-. --><definitions xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://webNpChunkerRo.uaic/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://webNpChunkerRo.uaic/" name="NpChunkerRoWS">
<types>
<xsd:schema>
<xsd:import namespace="http://webNpChunkerRo.uaic/" schemaLocation="http://nlptools.infoiasi.ro:80/WebNpChunkerRo/NpChunkerRoWS?xsd=1" />
</xsd:schema>
</types>
<message name="chunkText">
<part name="parameters" element="tns:chunkText" />
</message>
<message name="chunkTextResponse">
<part name="parameters" element="tns:chunkTextResponse" />
</message>
<message name="chunkTaggedText">
<part name="parameters" element="tns:chunkTaggedText" />
</message>
<message name="chunkTaggedTextResponse">
<part name="parameters" element="tns:chunkTaggedTextResponse" />
</message>
<portType name="NpChunkerRoWS">
<operation name="chunkText">
<input wsam:Action="http://webNpChunkerRo.uaic/NpChunkerRoWS/chunkTextRequest" message="tns:chunkText" />
<output wsam:Action="http://webNpChunkerRo.uaic/NpChunkerRoWS/chunkTextResponse" message="tns:chunkTextResponse" />
</operation>
<operation name="chunkTaggedText">
<input wsam:Action="http://webNpChunkerRo.uaic/NpChunkerRoWS/chunkTaggedTextRequest" message="tns:chunkTaggedText" />
<output wsam:Action="http://webNpChunkerRo.uaic/NpChunkerRoWS/chunkTaggedTextResponse" message="tns:chunkTaggedTextResponse" />
</operation>
</portType>
<binding name="NpChunkerRoWSPortBinding" type="tns:NpChunkerRoWS">
<soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document" />
<operation name="chunkText">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
<operation name="chunkTaggedText">
<soap:operation soapAction="" />
<input>
<soap:body use="literal" />
</input>
<output>
<soap:body use="literal" />
</output>
</operation>
</binding>
<service name="NpChunkerRoWS">
<port name="NpChunkerRoWSPort" binding="tns:NpChunkerRoWSPortBinding">
<soap:address location="http://nlptools.infoiasi.ro:80/WebNpChunkerRo/NpChunkerRoWS" />
</port>
</service>
</definitions>